mwg.wb.webapi/soapxml/GetCurrentInStocksBHXOnl.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetCurrentInStocksBHXOnl xmlns="http://tempuri.org/">
      <productID>{productID}</productID>
      <objCRMResultMessageBO>
        <IsError>true</IsError>
        <Message>string</Message>
        <MessageDetail>string</MessageDetail>
      </objCRMResultMessageBO>
    </GetCurrentInStocksBHXOnl>
  </soap:Body>
</soap:Envelope>